note/python-gevent.org
#+SETUPFILE: setup.org
#+TITLE: python gevent 学习
* 核心部分
** greenlets
   
在gevent中用到的主要模式是Greenlet, 它是以C扩展模块形式接入Python的轻量级协程。 Greenlet全部运行在
主程序操作系统进程的内部，但它们被协作式地调度。


在任何时刻，只有一个协程在运行。

大的任务可以分解成一系列的子任务,两个子任务之间的切换也就是上下文切换。

在gevent里面，上下文切换是通过yielding来完成的, 

=gevent.sleep(0)= : 采用gevent.sleep()时，会切换到另外一个使用 =gevent.spawn()= 衍生的函数去执行

=gevent.spawn()= : 会创建一个新的greenlet协程对象，并运行它

=gevent.joinall()= : 会等待所有传入的greenlet协程运行结束后再退出

=genvent.select=  : select 原理,在多路复用的模型中，比较常用的有select模型和epoll模型。这两个都是系统接口，由操作系统提供,
将需要判断有数据传来的（可读的）socket、可以向外发送数据的（可写的）socket及发生异常状态的socket交给select，
select会帮助我们从中遍历找出有事件发生的socket，并返回给我们，我们可以直接处理这些发生事件的socket 
,select()函数通常是一个在各种文件描述符上轮询的阻塞调用

#+BEGIN_SRC python
import time
import gevent
from gevent import select

start = time.time()
tic = lambda: 'at %1.1f seconds' % (time.time() - start)


def gr1():
    # Busy waits for a second, but we don't want to stick around...
    print('Started Polling: %s' % tic())
    select.select([], [], [], 2)
    print('Ended Polling: %s' % tic())


def gr2():
    # Busy waits for a second, but we don't want to stick around...
    print('Started Polling: %s' % tic())
    select.select([], [], [], 2)
    print('Ended Polling: %s' % tic())


def gr3():
    print("Hey lets do some stuff while the greenlets poll, %s" % tic())
    gevent.sleep(1)


gevent.joinall([
    gevent.spawn(gr1),
    gevent.spawn(gr2),
    gevent.spawn(gr3),
])
#+END_SRC
