note/python-gevent.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-24 Thu 22:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python gevent 学习</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="manue1" />
<link rel="stylesheet" type="text/css" href="https://www.manue1.site/css/style.css" />
<!-- <link rel="stylesheet" type="text/css" href="http://www.langdebuqing.com/css/style.css" /> -->
<link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" />
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.site">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">python gevent 学习</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf74d746">1. 核心部分</a>
<ul>
<li><a href="#org79c5599">1.1. greenlets</a></li>
<li><a href="#org379c625">1.2. 同步与异步</a></li>
<li><a href="#org1a043c7">1.3. 确定性</a></li>
<li><a href="#org1c5e286">1.4. 异常处理</a></li>
<li><a href="#orgf013a31">1.5. 程序停止</a></li>
<li><a href="#org8fdc38d">1.6. 超时</a></li>
<li><a href="#org5d67b86">1.7. 猴子补丁</a></li>
</ul>
</li>
<li><a href="#org10bc06c">2. 数据结构</a>
<ul>
<li><a href="#org5cd384a">2.1. 事件</a></li>
<li><a href="#org5ea0d8d">2.2. 队列</a></li>
<li><a href="#org55b1a25">2.3. 组和池</a></li>
<li><a href="#org6b4f647">2.4. 锁和信号量</a></li>
<li><a href="#org4eca3ca">2.5. 线程局部变量</a></li>
<li><a href="#org1ffe2d6">2.6. 子进程</a></li>
<li><a href="#orga6082c8">2.7. Actors</a></li>
</ul>
</li>
<li><a href="#orgd08a914">3. 应用</a>
<ul>
<li><a href="#org3eb0a7f">3.1. Gevent ZeroMQ</a></li>
<li><a href="#orgc676d20">3.2. 简单server</a></li>
<li><a href="#org157595e">3.3. WSGI Servers</a></li>
<li><a href="#org9045d4f">3.4. 流式server</a></li>
<li><a href="#org501c7a9">3.5. Long Polling</a></li>
<li><a href="#org281ce63">3.6. Websockets</a></li>
<li><a href="#org761703e">3.7. 聊天server</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf74d746" class="outline-2">
<h2 id="orgf74d746"><span class="section-number-2">1</span> 核心部分</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org79c5599" class="outline-3">
<h3 id="org79c5599"><span class="section-number-3">1.1</span> greenlets</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在gevent中用到的主要模式是Greenlet, 它是以C扩展模块形式接入Python的轻量级协程。 Greenlet全部运行在
主程序操作系统进程的内部，但它们被协作式地调度。
</p>


<p>
在任何时刻，只有一个协程在运行。
</p>

<p>
大的任务可以分解成一系列的子任务,两个子任务之间的切换也就是上下文切换。
</p>

<p>
在gevent里面，上下文切换是通过yielding来完成的, 
</p>

<p>
<code>gevent.sleep(0)</code> : 采用gevent.sleep()时，会切换到另外一个使用 <code>gevent.spawn()</code> 衍生的函数去执行
</p>

<p>
<code>gevent.spawn()</code> : 会创建一个新的greenlet协程对象，并运行它
</p>

<p>
<code>gevent.joinall()</code> : 会等待所有传入的greenlet协程运行结束后再退出
</p>

<p>
<code>genvent.select</code>  : select 原理,在多路复用的模型中，比较常用的有select模型和epoll模型。这两个都是系统接口，由操作系统提供,
将需要判断有数据传来的（可读的）socket、可以向外发送数据的（可写的）socket及发生异常状态的socket交给select，
select会帮助我们从中遍历找出有事件发生的socket，并返回给我们，我们可以直接处理这些发生事件的socket 
,select()函数通常是一个在各种文件描述符上轮询的阻塞调用
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> time
<span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent <span style="color: #9d0006;">import</span> select

<span style="color: #076678;">start</span> = time.time()
<span style="color: #076678;">tic</span> = <span style="color: #9d0006;">lambda</span>: <span style="color: #79740e;">'at %1.1f seconds'</span> % (time.time() - start)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">gr1</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #a89984;"># </span><span style="color: #a89984;">Busy waits for a second, but we don't want to stick around...</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Started Polling: %s'</span> % tic())
<span style="background-color: #ebdbb2;"> </span>   select.select([], [], [], 2)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Ended Polling: %s'</span> % tic())


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">gr2</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #a89984;"># </span><span style="color: #a89984;">Busy waits for a second, but we don't want to stick around...</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Started Polling: %s'</span> % tic())
<span style="background-color: #ebdbb2;"> </span>   select.select([], [], [], 2)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Ended Polling: %s'</span> % tic())


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">gr3</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Hey lets do some stuff while the greenlets poll, %s"</span> % tic())
<span style="background-color: #ebdbb2;"> </span>   gevent.sleep(1)


gevent.joinall([
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(gr1),
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(gr2),
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(gr3),
])
</pre>
</div>
</div>
</div>
