note/python-gevent.org
** 同步与异步

#+BEGIN_SRC python
import time
import gevent
import random


start = time.time()
tic_sync = lambda: 'at %1.5f seconds' % (time.time() - start)

def task(pid):
    """
    Some non-deterministic task
    """
    # gevent.sleep(random.randint(0, 2) * 0.001)
    gevent.sleep(0)
    # print('Task %s done' % pid)


def synchronous():
    for i in range(1, 10000):
        task(i)
    print "synchronous %s" % tic_sync()

start = time.time()
tic_async = lambda: 'at %1.5f seconds' % (time.time() - start)

def asynchronous():
    threads = [gevent.spawn(task, i) for i in xrange(10000)]
    gevent.joinall(threads)
    print "asynchronous %s" % tic_async()


print('Synchronous:')
synchronous()

print('Asynchronous:')
asynchronous()

# 不存在网络磁盘IO情况下,异步协程切换还是比同步慢10倍的
#+END_SRC

异步地向服务器取数据，取数据操作的执行时间依赖于发起取数据请求时远端服务器的负载，各个请求的执行时间会有差别。

=gevent.monky= : =gevent.monkey.patch_socket()= 使用monky补丁将进程内socket替换掉,变成非阻塞


#+BEGIN_SRC python
import gevent.monkey
gevent.monkey.patch_socket()

import gevent
import urllib2
import json
import time


def fetch(pid):
    response = urllib2.urlopen('http://10.253.69.22:8989/api/health/HnHOmQ8N')
    result = response.read()
    json_result = json.loads(result)
    status = json_result['status']
    # print('Process %s: %s' % (pid, status))
    return None


start = time.time()
tic = lambda: 'at %1.5f seconds' % (time.time() - start)


def synchronous():
    for i in range(1, 100):
        fetch(i)
    print "synchronous time : %s" % tic()


start = time.time()
tic = lambda: 'at %1.5f seconds' % (time.time() - start)


def asynchronous():
    threads = []
    for i in range(1, 100):
        threads.append(gevent.spawn(fetch, i))
    gevent.joinall(threads)
    print "asynchronous time :%s" % tic()


print('Synchronous:')
synchronous()

print('Asynchronous:')
asynchronous()

# 超过100次请求后,异步请求才开始有优势
#+END_SRC

** 确定性 
   greenlet具有确定性。在相同配置相同输入的情况下，它们总是会产生相同的输出
   #+BEGIN_SRC python
   import time


   def echo(i):
       time.sleep(0.001)
       return i


   # Non Deterministic Process Pool

   from multiprocessing.pool import Pool

   p = Pool(10)
   run1 = [a for a in p.imap_unordered(echo, xrange(10))]
   run2 = [a for a in p.imap_unordered(echo, xrange(10))]
   run3 = [a for a in p.imap_unordered(echo, xrange(10))]
   run4 = [a for a in p.imap_unordered(echo, xrange(10))]

   print(run1 == run2 == run3 == run4)

   # Deterministic Gevent Pool

   from gevent.pool import Pool

   p = Pool(10)
   run1 = [a for a in p.imap_unordered(echo, xrange(10))]
   run2 = [a for a in p.imap_unordered(echo, xrange(10))]
   run3 = [a for a in p.imap_unordered(echo, xrange(10))]
   run4 = [a for a in p.imap_unordered(echo, xrange(10))]

   print(run1 == run2 == run3 == run4)

   # multiprocessing 多线程处理后, 返回结果时无序的
   #+END_SRC

   此尽管gevent线程是一种“确定的并发”形式，使用它仍然可能会遇到像使用POSIX线程或进程时遇到的那些问题。
** 异常处理
   #+BEGIN_SRC python
   import gevent


   def win():
       print 'You win!'


   def fail():
       print 'Start fail'
       raise Exception('You fail at failing.')


   winner = gevent.spawn(win)
   loser = gevent.spawn(fail)

   print(winner.started)  # True
   print(loser.started)  # True

   # Exceptions raised in the Greenlet, stay inside the Greenlet.
   try:
       gevent.joinall([winner, loser])
   except Exception as e:
       print('This will never be reached, no work')
   #+END_SRC
