note/python-gevent.html
<div id="outline-container-org379c625" class="outline-3">
<h3 id="org379c625"><span class="section-number-3">1.2</span> 同步与异步</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> time
<span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">import</span> random


<span style="color: #076678;">start</span> = time.time()
<span style="color: #076678;">tic_sync</span> = <span style="color: #9d0006;">lambda</span>: <span style="color: #79740e;">'at %1.5f seconds'</span> % (time.time() - start)

<span style="color: #9d0006;">def</span> <span style="color: #b57614;">task</span>(pid):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">"""</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   Some non-deterministic task</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   """</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #a89984;"># </span><span style="color: #a89984;">gevent.sleep(random.randint(0, 2) * 0.001)</span>
<span style="background-color: #ebdbb2;"> </span>   gevent.sleep(0)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #a89984;"># </span><span style="color: #a89984;">print('Task %s done' % pid)</span>


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">synchronous</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">range</span>(1, 10000):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   task(i)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span> <span style="color: #79740e;">"synchronous %s"</span> % tic_sync()

<span style="color: #076678;">start</span> = time.time()
<span style="color: #076678;">tic_async</span> = <span style="color: #9d0006;">lambda</span>: <span style="color: #79740e;">'at %1.5f seconds'</span> % (time.time() - start)

<span style="color: #9d0006;">def</span> <span style="color: #b57614;">asynchronous</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">threads</span> = [gevent.spawn(task, i) <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">xrange</span>(10000)]
<span style="background-color: #ebdbb2;"> </span>   gevent.joinall(threads)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span> <span style="color: #79740e;">"asynchronous %s"</span> % tic_async()


<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Synchronous:'</span>)
synchronous()

<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Asynchronous:'</span>)
asynchronous()

<span style="color: #a89984;"># </span><span style="color: #a89984;">&#19981;&#23384;&#22312;&#32593;&#32476;&#30913;&#30424;IO&#24773;&#20917;&#19979;,&#24322;&#27493;&#21327;&#31243;&#20999;&#25442;&#36824;&#26159;&#27604;&#21516;&#27493;&#24930;10&#20493;&#30340;</span>
</pre>
</div>

<p>
异步地向服务器取数据，取数据操作的执行时间依赖于发起取数据请求时远端服务器的负载，各个请求的执行时间会有差别。
</p>

<p>
<code>gevent.monky</code> : <code>gevent.monkey.patch_socket()</code> 使用monky补丁将进程内socket替换掉,变成非阻塞
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent.monkey
gevent.monkey.patch_socket()

<span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">import</span> urllib2
<span style="color: #9d0006;">import</span> json
<span style="color: #9d0006;">import</span> time


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">fetch</span>(pid):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">response</span> = urllib2.urlopen(<span style="color: #79740e;">'http://10.253.69.22:8989/api/health/HnHOmQ8N'</span>)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">result</span> = response.read()
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">json_result</span> = json.loads(result)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">status</span> = json_result[<span style="color: #79740e;">'status'</span>]
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #a89984;"># </span><span style="color: #a89984;">print('Process %s: %s' % (pid, status))</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> <span style="color: #8f3f71;">None</span>


<span style="color: #076678;">start</span> = time.time()
<span style="color: #076678;">tic</span> = <span style="color: #9d0006;">lambda</span>: <span style="color: #79740e;">'at %1.5f seconds'</span> % (time.time() - start)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">synchronous</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">range</span>(1, 100):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   fetch(i)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span> <span style="color: #79740e;">"synchronous time : %s"</span> % tic()


<span style="color: #076678;">start</span> = time.time()
<span style="color: #076678;">tic</span> = <span style="color: #9d0006;">lambda</span>: <span style="color: #79740e;">'at %1.5f seconds'</span> % (time.time() - start)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">asynchronous</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">threads</span> = []
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">range</span>(1, 100):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   threads.append(gevent.spawn(fetch, i))
<span style="background-color: #ebdbb2;"> </span>   gevent.joinall(threads)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span> <span style="color: #79740e;">"asynchronous time :%s"</span> % tic()


<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Synchronous:'</span>)
synchronous()

<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Asynchronous:'</span>)
asynchronous()

<span style="color: #a89984;"># </span><span style="color: #a89984;">&#36229;&#36807;100&#27425;&#35831;&#27714;&#21518;,&#24322;&#27493;&#35831;&#27714;&#25165;&#24320;&#22987;&#26377;&#20248;&#21183;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a043c7" class="outline-3">
<h3 id="org1a043c7"><span class="section-number-3">1.3</span> 确定性</h3>
<div class="outline-text-3" id="text-1-3">
<p>
greenlet具有确定性。在相同配置相同输入的情况下，它们总是会产生相同的输出
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> time


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">echo</span>(i):
<span style="background-color: #ebdbb2;"> </span>   time.sleep(0.001)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> i


<span style="color: #a89984;"># </span><span style="color: #a89984;">Non Deterministic Process Pool</span>

<span style="color: #9d0006;">from</span> multiprocessing.pool <span style="color: #9d0006;">import</span> Pool

<span style="color: #076678;">p</span> = Pool(10)
<span style="color: #076678;">run1</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]
<span style="color: #076678;">run2</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]
<span style="color: #076678;">run3</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]
<span style="color: #076678;">run4</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]

<span style="color: #9d0006;">print</span>(run1 == run2 == run3 == run4)

<span style="color: #a89984;"># </span><span style="color: #a89984;">Deterministic Gevent Pool</span>

<span style="color: #9d0006;">from</span> gevent.pool <span style="color: #9d0006;">import</span> Pool

<span style="color: #076678;">p</span> = Pool(10)
<span style="color: #076678;">run1</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]
<span style="color: #076678;">run2</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]
<span style="color: #076678;">run3</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]
<span style="color: #076678;">run4</span> = [a <span style="color: #9d0006;">for</span> a <span style="color: #9d0006;">in</span> p.imap_unordered(echo, <span style="color: #af3a03;">xrange</span>(10))]

<span style="color: #9d0006;">print</span>(run1 == run2 == run3 == run4)

<span style="color: #a89984;"># </span><span style="color: #a89984;">multiprocessing &#22810;&#32447;&#31243;&#22788;&#29702;&#21518;, &#36820;&#22238;&#32467;&#26524;&#26102;&#26080;&#24207;&#30340;</span>
</pre>
</div>

<p>
此尽管gevent线程是一种“确定的并发”形式，使用它仍然可能会遇到像使用POSIX线程或进程时遇到的那些问题。
</p>
</div>
</div>
<div id="outline-container-org1c5e286" class="outline-3">
<h3 id="org1c5e286"><span class="section-number-3">1.4</span> 异常处理</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">win</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span> <span style="color: #79740e;">'You win!'</span>


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">fail</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span> <span style="color: #79740e;">'Start fail'</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">raise</span> <span style="color: #8f3f71;">Exception</span>(<span style="color: #79740e;">'You fail at failing.'</span>)


<span style="color: #076678;">winner</span> = gevent.spawn(win)
<span style="color: #076678;">loser</span> = gevent.spawn(fail)

<span style="color: #9d0006;">print</span>(winner.started)  <span style="color: #a89984;"># </span><span style="color: #a89984;">True</span>
<span style="color: #9d0006;">print</span>(loser.started)  <span style="color: #a89984;"># </span><span style="color: #a89984;">True</span>

<span style="color: #a89984;"># </span><span style="color: #a89984;">Exceptions raised in the Greenlet, stay inside the Greenlet.</span>
<span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   gevent.joinall([winner, loser])
<span style="color: #9d0006;">except</span> <span style="color: #8f3f71;">Exception</span> <span style="color: #9d0006;">as</span> e:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'This will never be reached, no work'</span>)
</pre>
</div>
</div>
</div>
