note/python-gevent.org
** 程序停止

当主程序(main program)收到一个SIGQUIT信号时，不能成功做yield操作的 Greenlet可能会令意外地挂起程序的
执行。这导致了所谓的僵尸进程，它需要在Python解释器之外被kill掉。

#+BEGIN_SRC python
import gevent
import signal


def run_forever():
    gevent.sleep(1000)


if __name__ == '__main__':
    gevent.signal(signal.SIGQUIT, gevent.shutdown)
    thread = gevent.spawn(run_forever)
    thread.join()
#+END_SRC

** 超时
   #+BEGIN_SRC python
   import gevent
   from gevent import Timeout


   def wait():
       gevent.sleep(2)
   # 三种调用Timeout方式

   # --
   timer = Timeout(1).start()
   thread1 = gevent.spawn(wait)

   try:
       thread1.join(timeout=timer)
   except Timeout:
       print('Thread 1 timed out')

   # --
   timer = Timeout.start_new(1)
   thread2 = gevent.spawn(wait)

   try:
       thread2.get(timeout=timer)
   except Timeout:
       print('Thread 2 timed out')

   # --
   try:
       gevent.with_timeout(1, wait)
   except Timeout:
       print('Thread 3 timed out')
   #+END_SRC
** 猴子补丁
   在极端情况下当一个库需要修改Python本身的基础行为的时候，猴子补丁就派上用场了。在这种情况下，gevent能够修改标准库里面
   大部分的阻塞式系统调用，包括socket、ssl、threading和 select等模块，而变为协作式运行。

   例如，Redis的python绑定一般使用常规的tcp socket来与redis-server实例通信。通过简单地调用
   gevent.monkey.patch_all()，可以使得redis的绑定协作式的调度请求，与gevent栈的其它部分一起工作。

   这让我们可以将一般不能与gevent共同工作的库结合起来，而不用写哪怕一行代码。虽然猴子补丁仍然是邪恶的
   (evil)，但在这种情况下它是“有用的邪恶(useful evil)”。

* 数据结构
** 事件

   协程间的通信

- *event*

   事件(event)是一个在Greenlet之间异步通信的形式。

   #+BEGIN_SRC python
   import gevent
   from gevent.event import Event
   '''
   Illustrates the use of events
   '''

   evt = Event()


   def setter():
       '''After 3 seconds, wake all threads waiting on the value of evt'''
       print('A: Hey wait for me, I have to do something')
       gevent.sleep(3)
       print("Ok, I'm done")
       evt.set()


   def waiter():
       '''After 3 seconds the get call will unblock'''
       print("I'll wait for you")
       evt.wait()  # blocking
       print("It's about time")


   def main():
       gevent.joinall([
           gevent.spawn(setter),
           gevent.spawn(waiter),
           gevent.spawn(waiter),
           gevent.spawn(waiter),
           gevent.spawn(waiter),
           gevent.spawn(waiter)
       ])

   main()
   #+END_SRC

- *AsyncResult*

  我是老板，让大哥和小弟同事去收账，小弟做完了后，会等大哥来问话。 

  如果小弟没有完成，还在做着事情，那大哥会在一个时间里，等待小弟返回结果。一直等 ！

  #+BEGIN_SRC python
  import gevent
  from gevent.event import AsyncResult

  a = AsyncResult()


  def setter():
      """
      After 3 seconds set the result of a.
      """
      gevent.sleep(3)
      a.set('Hello!')


  def waiter():
      """
      After 3 seconds the get call will unblock after the setter
      puts a value into the AsyncResult.
      """
      print(a.get())


  gevent.joinall([
      gevent.spawn(setter),
      gevent.spawn(waiter),
  ])
  #+END_SRC

