note/python-gevent.html
<div id="outline-container-orgf013a31" class="outline-3">
<h3 id="orgf013a31"><span class="section-number-3">1.5</span> 程序停止</h3>
<div class="outline-text-3" id="text-1-5">
<p>
当主程序(main program)收到一个SIGQUIT信号时，不能成功做yield操作的 Greenlet可能会令意外地挂起程序的
执行。这导致了所谓的僵尸进程，它需要在Python解释器之外被kill掉。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">import</span> signal


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">run_forever</span>():
<span style="background-color: #ebdbb2;"> </span>   gevent.sleep(1000)


<span style="color: #9d0006;">if</span> <span style="color: #af3a03;">__name__</span> == <span style="color: #79740e;">'__main__'</span>:
<span style="background-color: #ebdbb2;"> </span>   gevent.signal(signal.SIGQUIT, gevent.shutdown)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">thread</span> = gevent.spawn(run_forever)
<span style="background-color: #ebdbb2;"> </span>   thread.join()
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fdc38d" class="outline-3">
<h3 id="org8fdc38d"><span class="section-number-3">1.6</span> 超时</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent <span style="color: #9d0006;">import</span> Timeout


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">wait</span>():
<span style="background-color: #ebdbb2;"> </span>   gevent.sleep(2)
<span style="color: #a89984;"># </span><span style="color: #a89984;">&#19977;&#31181;&#35843;&#29992;Timeout&#26041;&#24335;</span>

<span style="color: #a89984;"># </span><span style="color: #a89984;">--</span>
<span style="color: #076678;">timer</span> = Timeout(1).start()
<span style="color: #076678;">thread1</span> = gevent.spawn(wait)

<span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   thread1.join(timeout=timer)
<span style="color: #9d0006;">except</span> Timeout:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Thread 1 timed out'</span>)

<span style="color: #a89984;"># </span><span style="color: #a89984;">--</span>
<span style="color: #076678;">timer</span> = Timeout.start_new(1)
<span style="color: #076678;">thread2</span> = gevent.spawn(wait)

<span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   thread2.get(timeout=timer)
<span style="color: #9d0006;">except</span> Timeout:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Thread 2 timed out'</span>)

<span style="color: #a89984;"># </span><span style="color: #a89984;">--</span>
<span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   gevent.with_timeout(1, wait)
<span style="color: #9d0006;">except</span> Timeout:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Thread 3 timed out'</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5d67b86" class="outline-3">
<h3 id="org5d67b86"><span class="section-number-3">1.7</span> 猴子补丁</h3>
<div class="outline-text-3" id="text-1-7">
<p>
在极端情况下当一个库需要修改Python本身的基础行为的时候，猴子补丁就派上用场了。在这种情况下，gevent能够修改标准库里面
大部分的阻塞式系统调用，包括socket、ssl、threading和 select等模块，而变为协作式运行。
</p>

<p>
例如，Redis的python绑定一般使用常规的tcp socket来与redis-server实例通信。通过简单地调用
gevent.monkey.patch<sub>all</sub>()，可以使得redis的绑定协作式的调度请求，与gevent栈的其它部分一起工作。
</p>

<p>
这让我们可以将一般不能与gevent共同工作的库结合起来，而不用写哪怕一行代码。虽然猴子补丁仍然是邪恶的
(evil)，但在这种情况下它是“有用的邪恶(useful evil)”。
</p>
</div>
</div>
</div>

<div id="outline-container-org10bc06c" class="outline-2">
<h2 id="org10bc06c"><span class="section-number-2">2</span> 数据结构</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5cd384a" class="outline-3">
<h3 id="org5cd384a"><span class="section-number-3">2.1</span> 事件</h3>
<div class="outline-text-3" id="text-2-1">
<p>
协程间的通信
</p>

<ul class="org-ul">
<li><p>
<b>event</b>
</p>

<p>
事件(event)是一个在Greenlet之间异步通信的形式。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent.event <span style="color: #9d0006;">import</span> Event
<span style="color: #79740e;">'''</span>
<span style="color: #79740e;">Illustrates the use of events</span>
<span style="color: #79740e;">'''</span>

<span style="color: #076678;">evt</span> = Event()


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">setter</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">'''After 3 seconds, wake all threads waiting on the value of evt'''</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'A: Hey wait for me, I have to do something'</span>)
<span style="background-color: #ebdbb2;"> </span>   gevent.sleep(3)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"Ok, I'm done"</span>)
<span style="background-color: #ebdbb2;"> </span>   evt.<span style="color: #af3a03;">set</span>()


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">waiter</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">'''After 3 seconds the get call will unblock'''</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"I'll wait for you"</span>)
<span style="background-color: #ebdbb2;"> </span>   evt.wait()  <span style="color: #a89984;"># </span><span style="color: #a89984;">blocking</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"It's about time"</span>)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">main</span>():
<span style="background-color: #ebdbb2;"> </span>   gevent.joinall([
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.spawn(setter),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.spawn(waiter),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.spawn(waiter),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.spawn(waiter),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.spawn(waiter),
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.spawn(waiter)
<span style="background-color: #ebdbb2;"> </span>   ])

main()
</pre>
</div></li>

<li><p>
<b>AsyncResult</b>
</p>

<p>
我是老板，让大哥和小弟同事去收账，小弟做完了后，会等大哥来问话。 
</p>

<p>
如果小弟没有完成，还在做着事情，那大哥会在一个时间里，等待小弟返回结果。一直等 ！
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent.event <span style="color: #9d0006;">import</span> AsyncResult

<span style="color: #076678;">a</span> = AsyncResult()


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">setter</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">"""</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   After 3 seconds set the result of a.</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   """</span>
<span style="background-color: #ebdbb2;"> </span>   gevent.sleep(3)
<span style="background-color: #ebdbb2;"> </span>   a.<span style="color: #af3a03;">set</span>(<span style="color: #79740e;">'Hello!'</span>)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">waiter</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">"""</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   After 3 seconds the get call will unblock after the setter</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   puts a value into the AsyncResult.</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   """</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(a.get())


gevent.joinall([
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(setter),
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(waiter),
])
</pre>
</div></li>
</ul>
</div>
</div>
