note/python-gevent.org
** 队列

   如果一个Greenlet从队列中取出一项，此项就不会被同时执行的其它Greenlet再取到了

   使用起来和一般队列一样

   put和get操作都有非阻塞的版本，put_nowait和get_nowait不会阻塞，
   然而在操作不能完成时抛出gevent.queue.Empty或gevent.queue.Full异常。


   #+BEGIN_SRC python
   import gevent
   from gevent.queue import Queue, Empty

   tasks = Queue(maxsize=3)

   """get_nowait非阻塞，默认队列没有数据便会抛出gevent.queue.Empty异常

   get是阻塞的 设置timeout后便会在超时之后不阻塞
   """


   # while not tasks.empty():
   def worker(n):
       try:
           while True:
               task = tasks.get(timeout=1)  # decrements queue size by 1
               print('Worker %s got task %s' % (n, task))
               gevent.sleep(0)
       except Empty:
           print('Quitting time!')


   def boss():
       """
       Boss will wait to hand out work until a individual worker is
       free since the maxsize of the task queue is 3.
       """

       for i in xrange(1, 10):
           tasks.put(i)
       print('Assigned all work in iteration 1')

       for i in xrange(10, 20):
           tasks.put(i)
       print('Assigned all work in iteration 2')


   gevent.joinall([
       gevent.spawn(boss),
       gevent.spawn(worker, 'steve'),
       gevent.spawn(worker, 'john'),
       gevent.spawn(worker, 'bob'),
   ])

   #+END_SRC
   
** 组和池
   组(group)是一个运行中greenlet的集合，集合中的greenlet像一个组一样会被共同管理和调度。
   它也兼饰了像Python的multiprocessing库那样的平行调度器的角色。

   Group也以不同的方式为分组greenlet/分发工作和收集它们的结果也提供了API

   imap / imap_unordered (有序 无序返回结果)

   #+BEGIN_SRC python
   import gevent
   from gevent import getcurrent
   from gevent.pool import Group

   group = Group()


   def hello_from(n):
       print('Size of group %s' % len(group))
       print('Hello from Greenlet %s' % id(getcurrent()))


   group.map(hello_from, xrange(3))


   def intensive(n):
       gevent.sleep(3 - n)
       return 'task', n


   print('Ordered')

   ogroup = Group()
   for i in ogroup.imap(intensive, xrange(3)):
       print(i)

   print('Unordered')

   igroup = Group()
   for i in igroup.imap_unordered(intensive, xrange(3)):
       print(i)
   #+END_SRC

   池(pool)是一个为处理数量变化并且需要 *限制并发* 的greenlet而设计的结构。在需要并行地做很多受限于网络和IO的任务时常常需要用到它。

   #+BEGIN_SRC python
   import gevent
   from gevent.pool import Pool

   pool = Pool(2)

   def hello_from(n):
       print('Size of pool %s' % len(pool))

   pool.map(hello_from, xrange(3))

   # Size of pool 2
   # Size of pool 2
   # Size of pool 1


   #+END_SRC

   #+BEGIN_SRC python
   from gevent.pool import Pool


   class SocketPool(object):
       """当构造gevent驱动的服务时，经常会将围绕一个池结构的整个服务作为中心。一个例子就是在各个socket上轮询的类。
       """
       def __init__(self):
           self.pool = Pool(1000)
           self.pool.start()

       def listen(self, socket):
           while True:
               socket.recv()

       def add_handler(self, socket):
           if self.pool.full():
               raise Exception("At maximum pool size")
           else:
               self.pool.spawn(self.listen, socket)

       def shutdown(self):
           self.pool.kill()
   #+END_SRC

