note/python-gevent.html

<div id="outline-container-org5ea0d8d" class="outline-3">
<h3 id="org5ea0d8d"><span class="section-number-3">2.2</span> 队列</h3>
<div class="outline-text-3" id="text-2-2">
<p>
如果一个Greenlet从队列中取出一项，此项就不会被同时执行的其它Greenlet再取到了
</p>

<p>
使用起来和一般队列一样
</p>

<p>
put和get操作都有非阻塞的版本，put<sub>nowait和get</sub><sub>nowait不会阻塞</sub>，
然而在操作不能完成时抛出gevent.queue.Empty或gevent.queue.Full异常。
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent.queue <span style="color: #9d0006;">import</span> Queue, Empty

<span style="color: #076678;">tasks</span> = Queue(maxsize=3)

<span style="color: #79740e;">"""get_nowait&#38750;&#38459;&#22622;&#65292;&#40664;&#35748;&#38431;&#21015;&#27809;&#26377;&#25968;&#25454;&#20415;&#20250;&#25243;&#20986;gevent.queue.Empty&#24322;&#24120;</span>

<span style="color: #79740e;">get&#26159;&#38459;&#22622;&#30340; &#35774;&#32622;timeout&#21518;&#20415;&#20250;&#22312;&#36229;&#26102;&#20043;&#21518;&#19981;&#38459;&#22622;</span>
<span style="color: #79740e;">"""</span>


<span style="color: #a89984;"># </span><span style="color: #a89984;">while not tasks.empty():</span>
<span style="color: #9d0006;">def</span> <span style="color: #b57614;">worker</span>(n):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">while</span> <span style="color: #8f3f71;">True</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">task</span> = tasks.get(timeout=1)  <span style="color: #a89984;"># </span><span style="color: #a89984;">decrements queue size by 1</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Worker %s got task %s'</span> % (n, task))
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.sleep(0)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">except</span> Empty:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Quitting time!'</span>)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">boss</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">"""</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   Boss will wait to hand out work until a individual worker is</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   free since the maxsize of the task queue is 3.</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   """</span>

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">xrange</span>(1, 10):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   tasks.put(i)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Assigned all work in iteration 1'</span>)

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">xrange</span>(10, 20):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   tasks.put(i)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Assigned all work in iteration 2'</span>)


gevent.joinall([
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(boss),
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(worker, <span style="color: #79740e;">'steve'</span>),
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(worker, <span style="color: #79740e;">'john'</span>),
<span style="background-color: #ebdbb2;"> </span>   gevent.spawn(worker, <span style="color: #79740e;">'bob'</span>),
])

</pre>
</div>
</div>
</div>

<div id="outline-container-org55b1a25" class="outline-3">
<h3 id="org55b1a25"><span class="section-number-3">2.3</span> 组和池</h3>
<div class="outline-text-3" id="text-2-3">
<p>
组(group)是一个运行中greenlet的集合，集合中的greenlet像一个组一样会被共同管理和调度。
它也兼饰了像Python的multiprocessing库那样的平行调度器的角色。
</p>

<p>
Group也以不同的方式为分组greenlet/分发工作和收集它们的结果也提供了API
</p>

<p>
imap / imap<sub>unordered</sub> (有序 无序返回结果)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent <span style="color: #9d0006;">import</span> getcurrent
<span style="color: #9d0006;">from</span> gevent.pool <span style="color: #9d0006;">import</span> Group

<span style="color: #076678;">group</span> = Group()


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">hello_from</span>(n):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Size of group %s'</span> % <span style="color: #af3a03;">len</span>(group))
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Hello from Greenlet %s'</span> % <span style="color: #af3a03;">id</span>(getcurrent()))


group.<span style="color: #af3a03;">map</span>(hello_from, <span style="color: #af3a03;">xrange</span>(3))


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">intensive</span>(n):
<span style="background-color: #ebdbb2;"> </span>   gevent.sleep(3 - n)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> <span style="color: #79740e;">'task'</span>, n


<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Ordered'</span>)

<span style="color: #076678;">ogroup</span> = Group()
<span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> ogroup.imap(intensive, <span style="color: #af3a03;">xrange</span>(3)):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(i)

<span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Unordered'</span>)

<span style="color: #076678;">igroup</span> = Group()
<span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> igroup.imap_unordered(intensive, <span style="color: #af3a03;">xrange</span>(3)):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(i)
</pre>
</div>

<p>
池(pool)是一个为处理数量变化并且需要 <b>限制并发</b> 的greenlet而设计的结构。在需要并行地做很多受限于网络和IO的任务时常常需要用到它。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent.pool <span style="color: #9d0006;">import</span> Pool

<span style="color: #076678;">pool</span> = Pool(2)

<span style="color: #9d0006;">def</span> <span style="color: #b57614;">hello_from</span>(n):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Size of pool %s'</span> % <span style="color: #af3a03;">len</span>(pool))

pool.<span style="color: #af3a03;">map</span>(hello_from, <span style="color: #af3a03;">xrange</span>(3))

<span style="color: #a89984;"># </span><span style="color: #a89984;">Size of pool 2</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">Size of pool 2</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">Size of pool 1</span>


</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">from</span> gevent.pool <span style="color: #9d0006;">import</span> Pool


<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">SocketPool</span>(<span style="color: #af3a03;">object</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">"""&#24403;&#26500;&#36896;gevent&#39537;&#21160;&#30340;&#26381;&#21153;&#26102;&#65292;&#32463;&#24120;&#20250;&#23558;&#22260;&#32469;&#19968;&#20010;&#27744;&#32467;&#26500;&#30340;&#25972;&#20010;&#26381;&#21153;&#20316;&#20026;&#20013;&#24515;&#12290;&#19968;&#20010;&#20363;&#23376;&#23601;&#26159;&#22312;&#21508;&#20010;socket&#19978;&#36718;&#35810;&#30340;&#31867;&#12290;</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   """</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__init__</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.pool = Pool(1000)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.pool.start()

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">listen</span>(<span style="color: #9d0006;">self</span>, socket):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">while</span> <span style="color: #8f3f71;">True</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   socket.recv()

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">add_handler</span>(<span style="color: #9d0006;">self</span>, socket):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">if</span> <span style="color: #9d0006;">self</span>.pool.full():
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">raise</span> <span style="color: #8f3f71;">Exception</span>(<span style="color: #79740e;">"At maximum pool size"</span>)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">else</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.pool.spawn(<span style="color: #9d0006;">self</span>.listen, socket)

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">shutdown</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.pool.kill()
</pre>
</div>
</div>
</div>
