note/python-gevent.org
** 锁和信号量

   信号量是一个允许greenlet相互合作，限制并发访问或运行的低层次的同步原语

   信号量有两个方法，acquire和release。
   在信号量是否已经被 acquire或release，和拥有资源的数量之间不同，被称为此信号量的范围 
   (the bound of the semaphore)。
   如果一个信号量的范围已经降低到0，它会阻塞acquire操作直到另一个已经获得信号量的greenlet作出释放。

   范围为1的信号量也称为锁(lock)。它向单个greenlet提供了互斥访问。信号量和锁常常用来保证资源只在程序上下文被单次使用。

   # TODO 替换信号示例

   #+BEGIN_SRC python
   from gevent import sleep
   from gevent.pool import Pool
   try:
       from gevent.coros import BoundedSemaphore
   except:
       from gevent.lock import BoundedSemaphore

   sem = BoundedSemaphore(2)


   def worker1(n):
       sem.acquire()
       print('Worker %i acquired semaphore' % n)
       sleep(0)
       sem.release()
       print('Worker %i released semaphore' % n)


   def worker2(n):
       with sem:
           print('Worker %i acquired semaphore' % n)
           sleep(0)
       print('Worker %i released semaphore' % n)


   pool = Pool()
   pool.map(worker1, xrange(0, 2))
   pool.map(worker2, xrange(3, 6))
   #+END_SRC

** 线程局部变量

   Gevent也允许你指定局部于greenlet上下文的数据。在内部，它被实现为以greenlet的getcurrent()为键，在一个私有命名空间寻址的全局查找。

   #+BEGIN_SRC python
   import gevent
   from gevent.local import local

   stash = local()


   def f1():
       stash.x = 1
       print(stash.x)


   def f2():
       stash.y = 2
       print(stash.y)

       try:
           stash.x
       except AttributeError:
           print("x is not local to f2")


   g1 = gevent.spawn(f1)
   g2 = gevent.spawn(f2)

   gevent.joinall([g1, g2])
   #+END_SRC    

   很多集成了gevent的web框架将 *HTTP会话对象*  以线程局部变量的方式存储在gevent内。
   例如使用Werkzeug实用库和它的proxy对象，我们可以创建Flask风格的请求对象。

   Werkzeug 是一个 WSGI 工具包，它可以作为一个 Web 框架的底层库


   #+BEGIN_SRC python
   from gevent.local import local
   from werkzeug.local import LocalProxy
   from werkzeug.wrappers import Request
   from contextlib import contextmanager
   try:
       from gevent.wsgi import WSGIServer
   except:
       from gevent.pywsgi import WSGIServer

   _requests = local()
   request = LocalProxy(lambda: _requests.request)


   @contextmanager
   def sessionmanager(environ):
       _requests.request = Request(environ)
       yield
       _requests.request = None


   def logic():
       return "Hello " + request.remote_addr


   def application(environ, start_response):
       status = '200 OK'

       with sessionmanager(environ):
           body = logic()

       headers = [('Content-Type', 'text/html')]

       start_response(status, headers)
       return [body]


   WSGIServer(('', 8000), application).serve_forever()

   # http://127.0.0.1:8000/
   # Hello ::ffff:127.0.0.1
   #+END_SRC

   Flask系统比这个例子复杂一点，然而使用线程局部变量作为局部的会话存储，这个思想是相同的。
   
