note/python-gevent.html

<div id="outline-container-org6b4f647" class="outline-3">
<h3 id="org6b4f647"><span class="section-number-3">2.4</span> 锁和信号量</h3>
<div class="outline-text-3" id="text-2-4">
<p>
信号量是一个允许greenlet相互合作，限制并发访问或运行的低层次的同步原语
</p>

<p>
信号量有两个方法，acquire和release。
在信号量是否已经被 acquire或release，和拥有资源的数量之间不同，被称为此信号量的范围 
(the bound of the semaphore)。
如果一个信号量的范围已经降低到0，它会阻塞acquire操作直到另一个已经获得信号量的greenlet作出释放。
</p>

<p>
范围为1的信号量也称为锁(lock)。它向单个greenlet提供了互斥访问。信号量和锁常常用来保证资源只在程序上下文被单次使用。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">from</span> gevent <span style="color: #9d0006;">import</span> sleep
<span style="color: #9d0006;">from</span> gevent.pool <span style="color: #9d0006;">import</span> Pool
<span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">from</span> gevent.coros <span style="color: #9d0006;">import</span> BoundedSemaphore
<span style="color: #9d0006;">except</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">from</span> gevent.lock <span style="color: #9d0006;">import</span> BoundedSemaphore

<span style="color: #076678;">sem</span> = BoundedSemaphore(2)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">worker1</span>(n):
<span style="background-color: #ebdbb2;"> </span>   sem.acquire()
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Worker %i acquired semaphore'</span> % n)
<span style="background-color: #ebdbb2;"> </span>   sleep(0)
<span style="background-color: #ebdbb2;"> </span>   sem.release()
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Worker %i released semaphore'</span> % n)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">worker2</span>(n):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">with</span> sem:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Worker %i acquired semaphore'</span> % n)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   sleep(0)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">'Worker %i released semaphore'</span> % n)


<span style="color: #076678;">pool</span> = Pool()
pool.<span style="color: #af3a03;">map</span>(worker1, <span style="color: #af3a03;">xrange</span>(0, 2))
pool.<span style="color: #af3a03;">map</span>(worker2, <span style="color: #af3a03;">xrange</span>(3, 6))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4eca3ca" class="outline-3">
<h3 id="org4eca3ca"><span class="section-number-3">2.5</span> 线程局部变量</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Gevent也允许你指定局部于greenlet上下文的数据。在内部，它被实现为以greenlet的getcurrent()为键，在一个私有命名空间寻址的全局查找。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent.local <span style="color: #9d0006;">import</span> local

<span style="color: #076678;">stash</span> = local()


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">f1</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">stash.x</span> = 1
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(stash.x)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">f2</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">stash.y</span> = 2
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(stash.y)

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   stash.x
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">except</span> <span style="color: #8f3f71;">AttributeError</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"x is not local to f2"</span>)


<span style="color: #076678;">g1</span> = gevent.spawn(f1)
<span style="color: #076678;">g2</span> = gevent.spawn(f2)

gevent.joinall([g1, g2])
</pre>
</div>

<p>
很多集成了gevent的web框架将 <b>HTTP会话对象</b>  以线程局部变量的方式存储在gevent内。
例如使用Werkzeug实用库和它的proxy对象，我们可以创建Flask风格的请求对象。
</p>

<p>
Werkzeug 是一个 WSGI 工具包，它可以作为一个 Web 框架的底层库
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">from</span> gevent.local <span style="color: #9d0006;">import</span> local
<span style="color: #9d0006;">from</span> werkzeug.local <span style="color: #9d0006;">import</span> LocalProxy
<span style="color: #9d0006;">from</span> werkzeug.wrappers <span style="color: #9d0006;">import</span> Request
<span style="color: #9d0006;">from</span> contextlib <span style="color: #9d0006;">import</span> contextmanager
<span style="color: #9d0006;">try</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">from</span> gevent.wsgi <span style="color: #9d0006;">import</span> WSGIServer
<span style="color: #9d0006;">except</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">from</span> gevent.pywsgi <span style="color: #9d0006;">import</span> WSGIServer

<span style="color: #076678;">_requests</span> = local()
<span style="color: #076678;">request</span> = LocalProxy(<span style="color: #9d0006;">lambda</span>: _requests.request)


<span style="color: #8f3f71;">@contextmanager</span>
<span style="color: #9d0006;">def</span> <span style="color: #b57614;">sessionmanager</span>(environ):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">_requests.request</span> = Request(environ)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">yield</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">_requests.request</span> = <span style="color: #8f3f71;">None</span>


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">logic</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> <span style="color: #79740e;">"Hello "</span> + request.remote_addr


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">application</span>(environ, start_response):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">status</span> = <span style="color: #79740e;">'200 OK'</span>

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">with</span> sessionmanager(environ):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">body</span> = logic()

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">headers</span> = [(<span style="color: #79740e;">'Content-Type'</span>, <span style="color: #79740e;">'text/html'</span>)]

<span style="background-color: #ebdbb2;"> </span>   start_response(status, headers)
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">return</span> [body]


WSGIServer((<span style="color: #79740e;">''</span>, 8000), application).serve_forever()

<span style="color: #a89984;"># </span><span style="color: #a89984;">http://127.0.0.1:8000/</span>
<span style="color: #a89984;"># </span><span style="color: #a89984;">Hello ::ffff:127.0.0.1</span>
</pre>
</div>

<p>
Flask系统比这个例子复杂一点，然而使用线程局部变量作为局部的会话存储，这个思想是相同的。
</p>
</div>
</div>
