note/python-gevent.org
** 子进程
   自gevent 1.0起，gevent.subprocess，一个Python subprocess模块的修补版本已经添加。它支持协作式的等待子进程。

   Python rstrip() 删除 string 字符串末尾的指定字符（默认为空格）

   #+BEGIN_SRC python

   import gevent
   from gevent.subprocess import Popen, PIPE


   def cron():
       while True:
           print("cron")
           gevent.sleep(0.2)


   g = gevent.spawn(cron)
   sub = Popen(['sleep 1; uname'], stdout=PIPE, shell=True)
   out, err = sub.communicate()
   g.kill()
   print(out.rstrip())

   #cron
   #cron
   #cron
   #cron
   #cron
   #cron
   #Darwin

   #+END_SRC
   
   gevent 与 multiprocessing 分别创建子进程后,通信

   最明显的挑战之一就是multiprocessing提供的进程间通信默认不是协作式的

   =multiprocessing.Connection= 的对象(例如Pipe)暴露了它们下面的文件描述符(file descriptor)，

   =gevent.socket.wait_read= 和 =wait_write= 可以用来在直接读写之前协作式的等待ready-to-read/ready-to-write事件。


   #+BEGIN_SRC python
   import gevent
   from multiprocessing import Process, Pipe
   from gevent.socket import wait_read, wait_write

   # To Process
   a, b = Pipe()

   # From Process
   c, d = Pipe()


   def relay():
       for i in xrange(10):
           msg = b.recv()
           c.send(msg + " in " + str(i))


   def put_msg():
       for i in xrange(10):
           wait_write(a.fileno())
           a.send('hi')


   def get_msg():
       for i in xrange(10):
           wait_read(d.fileno())
           print(d.recv())


   proc = Process(target=relay)
   proc.start()

   g1 = gevent.spawn(get_msg)
   g2 = gevent.spawn(put_msg)
   gevent.joinall([g1, g2], timeout=1)

   """
   hi in 0
   hi in 1
   hi in 2
   hi in 3
   hi in 4
   hi in 5
   hi in 6
   hi in 7
   hi in 8
   hi in 9

   hi -> a ->b -> c -> d 
   """
   #+END_SRC

** Actors 

   actor模型是一个由于Erlang变得普及的 *更高层的并发模型* 。
   简单的说它的主要思想就是:
   *许多个独立的Actor，每个Actor有一个可以从其它Actor接收消息的收件箱。
   Actor内部的主循环遍历它收到的消息，并根据它期望的行为来采取行动* 

   #+BEGIN_SRC python
   import gevent
   from gevent.queue import Queue
   from gevent import Greenlet


   class Actor(gevent.Greenlet):
       def __init__(self):
           self.inbox = Queue()
           Greenlet.__init__(self)

       def receive(self, message):
           """
           Define in your subclass.
           """
           raise NotImplemented()

       def _run(self):
           self.running = True
           while self.running:
               message = self.inbox.get()
               self.receive(message)


   class Pinger(Actor):
       def receive(self, message):
           print("ping: %s " % message)
           pong.inbox.put('ping send to pong')
           gevent.sleep(0)


   class Ponger(Actor):
       def receive(self, message):
           print("pong: %s" % message)
           ping.inbox.put('pong')
           gevent.sleep(0)


   ping = Pinger()
   pong = Ponger()

   ping.start()
   pong.start()

   ping.inbox.put('start')
   gevent.joinall([ping, pong])

   #无限循环
   #+END_SRC

* 应用
** Gevent ZeroMQ
** 简单server
** WSGI Servers
** 流式server
** Long Polling
** Websockets
** 聊天server