note/python-gevent.html

<div id="outline-container-org1ffe2d6" class="outline-3">
<h3 id="org1ffe2d6"><span class="section-number-3">2.6</span> 子进程</h3>
<div class="outline-text-3" id="text-2-6">
<p>
自gevent 1.0起，gevent.subprocess，一个Python subprocess模块的修补版本已经添加。它支持协作式的等待子进程。
</p>

<p>
Python rstrip() 删除 string 字符串末尾的指定字符（默认为空格）
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent.subprocess <span style="color: #9d0006;">import</span> Popen, PIPE


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">cron</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">while</span> <span style="color: #8f3f71;">True</span>:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"cron"</span>)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.sleep(0.2)


<span style="color: #076678;">g</span> = gevent.spawn(cron)
<span style="color: #076678;">sub</span> = Popen([<span style="color: #79740e;">'sleep 1; uname'</span>], stdout=PIPE, shell=<span style="color: #8f3f71;">True</span>)
<span style="color: #076678;">out</span>, <span style="color: #076678;">err</span> = sub.communicate()
g.kill()
<span style="color: #9d0006;">print</span>(out.rstrip())

<span style="color: #a89984;">#</span><span style="color: #a89984;">cron</span>
<span style="color: #a89984;">#</span><span style="color: #a89984;">cron</span>
<span style="color: #a89984;">#</span><span style="color: #a89984;">cron</span>
<span style="color: #a89984;">#</span><span style="color: #a89984;">cron</span>
<span style="color: #a89984;">#</span><span style="color: #a89984;">cron</span>
<span style="color: #a89984;">#</span><span style="color: #a89984;">cron</span>
<span style="color: #a89984;">#</span><span style="color: #a89984;">Darwin</span>

</pre>
</div>

<p>
gevent 与 multiprocessing 分别创建子进程后,通信
</p>

<p>
最明显的挑战之一就是multiprocessing提供的进程间通信默认不是协作式的
</p>

<p>
<code>multiprocessing.Connection</code> 的对象(例如Pipe)暴露了它们下面的文件描述符(file descriptor)，
</p>

<p>
<code>gevent.socket.wait_read</code> 和 <code>wait_write</code> 可以用来在直接读写之前协作式的等待ready-to-read/ready-to-write事件。
</p>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> multiprocessing <span style="color: #9d0006;">import</span> Process, Pipe
<span style="color: #9d0006;">from</span> gevent.socket <span style="color: #9d0006;">import</span> wait_read, wait_write

<span style="color: #a89984;"># </span><span style="color: #a89984;">To Process</span>
<span style="color: #076678;">a</span>, <span style="color: #076678;">b</span> = Pipe()

<span style="color: #a89984;"># </span><span style="color: #a89984;">From Process</span>
<span style="color: #076678;">c</span>, <span style="color: #076678;">d</span> = Pipe()


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">relay</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">xrange</span>(10):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">msg</span> = b.recv()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   c.send(msg + <span style="color: #79740e;">" in "</span> + <span style="color: #af3a03;">str</span>(i))


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">put_msg</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">xrange</span>(10):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   wait_write(a.fileno())
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   a.send(<span style="color: #79740e;">'hi'</span>)


<span style="color: #9d0006;">def</span> <span style="color: #b57614;">get_msg</span>():
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">for</span> i <span style="color: #9d0006;">in</span> <span style="color: #af3a03;">xrange</span>(10):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   wait_read(d.fileno())
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(d.recv())


<span style="color: #076678;">proc</span> = Process(target=relay)
proc.start()

<span style="color: #076678;">g1</span> = gevent.spawn(get_msg)
<span style="color: #076678;">g2</span> = gevent.spawn(put_msg)
gevent.joinall([g1, g2], timeout=1)

<span style="color: #79740e;">"""</span>
<span style="color: #79740e;">hi in 0</span>
<span style="color: #79740e;">hi in 1</span>
<span style="color: #79740e;">hi in 2</span>
<span style="color: #79740e;">hi in 3</span>
<span style="color: #79740e;">hi in 4</span>
<span style="color: #79740e;">hi in 5</span>
<span style="color: #79740e;">hi in 6</span>
<span style="color: #79740e;">hi in 7</span>
<span style="color: #79740e;">hi in 8</span>
<span style="color: #79740e;">hi in 9</span>

<span style="color: #79740e;">hi -&gt; a -&gt;b -&gt; c -&gt; d </span>
<span style="color: #79740e;">"""</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6082c8" class="outline-3">
<h3 id="orga6082c8"><span class="section-number-3">2.7</span> Actors</h3>
<div class="outline-text-3" id="text-2-7">
<p>
actor模型是一个由于Erlang变得普及的 <b>更高层的并发模型</b> 。
简单的说它的主要思想就是:
<b>许多个独立的Actor，每个Actor有一个可以从其它Actor接收消息的收件箱。
Actor内部的主循环遍历它收到的消息，并根据它期望的行为来采取行动</b> 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #9d0006;">import</span> gevent
<span style="color: #9d0006;">from</span> gevent.queue <span style="color: #9d0006;">import</span> Queue
<span style="color: #9d0006;">from</span> gevent <span style="color: #9d0006;">import</span> Greenlet


<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">Actor</span>(gevent.Greenlet):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">__init__</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.inbox = Queue()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   Greenlet.__init__(<span style="color: #9d0006;">self</span>)

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">receive</span>(<span style="color: #9d0006;">self</span>, message):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #79740e;">"""</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   </span><span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   Define in your subclass.</span>
<span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   </span><span style="color: #79740e; background-color: #ebdbb2;"> </span><span style="color: #79740e;">   """</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">raise</span> <span style="color: #8f3f71;">NotImplemented</span>()

<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">_run</span>(<span style="color: #9d0006;">self</span>):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.running = <span style="color: #8f3f71;">True</span>
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">while</span> <span style="color: #9d0006;">self</span>.running:
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #076678;">message</span> = <span style="color: #9d0006;">self</span>.inbox.get()
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">self</span>.receive(message)


<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">Pinger</span>(Actor):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">receive</span>(<span style="color: #9d0006;">self</span>, message):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"ping: %s "</span> % message)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   pong.inbox.put(<span style="color: #79740e;">'ping send to pong'</span>)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.sleep(0)


<span style="color: #9d0006;">class</span> <span style="color: #8f3f71;">Ponger</span>(Actor):
<span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">def</span> <span style="color: #b57614;">receive</span>(<span style="color: #9d0006;">self</span>, message):
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   <span style="color: #9d0006;">print</span>(<span style="color: #79740e;">"pong: %s"</span> % message)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   ping.inbox.put(<span style="color: #79740e;">'pong'</span>)
<span style="background-color: #ebdbb2;"> </span>   <span style="background-color: #ebdbb2;"> </span>   gevent.sleep(0)


<span style="color: #076678;">ping</span> = Pinger()
<span style="color: #076678;">pong</span> = Ponger()

ping.start()
pong.start()

ping.inbox.put(<span style="color: #79740e;">'start'</span>)
gevent.joinall([ping, pong])

<span style="color: #a89984;">#</span><span style="color: #a89984;">&#26080;&#38480;&#24490;&#29615;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd08a914" class="outline-2">
<h2 id="orgd08a914"><span class="section-number-2">3</span> 应用</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3eb0a7f" class="outline-3">
<h3 id="org3eb0a7f"><span class="section-number-3">3.1</span> Gevent ZeroMQ</h3>
</div>
<div id="outline-container-orgc676d20" class="outline-3">
<h3 id="orgc676d20"><span class="section-number-3">3.2</span> 简单server</h3>
</div>
<div id="outline-container-org157595e" class="outline-3">
<h3 id="org157595e"><span class="section-number-3">3.3</span> WSGI Servers</h3>
</div>
<div id="outline-container-org9045d4f" class="outline-3">
<h3 id="org9045d4f"><span class="section-number-3">3.4</span> 流式server</h3>
</div>
<div id="outline-container-org501c7a9" class="outline-3">
<h3 id="org501c7a9"><span class="section-number-3">3.5</span> Long Polling</h3>
</div>
<div id="outline-container-org281ce63" class="outline-3">
<h3 id="org281ce63"><span class="section-number-3">3.6</span> Websockets</h3>
</div>
<div id="outline-container-org761703e" class="outline-3">
<h3 id="org761703e"><span class="section-number-3">3.7</span> 聊天server</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="https://www.manue1.site/css/jquery-2.1.3.min.js"></script>
<script src="https://www.manue1.site/css/main.js"></script>
<!-- <script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
     <script src="http://www.langdebuqing.com/css/main.js"></script> -->
</div>
</body>
</html>